---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures
source: html/3165dce1-32eb-c201-e79f-da4551118612.htm
---
# BuiltInFailures.ViewSheetFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.